# MDSC- 201(p)

## Name : V.Sai Kumar 
## Reg.no : 22235

# TOPIC : Reading CSV Files

In [21]:
## reading the csv data into variable

In [10]:
data <- read.csv("meal_info.csv")


head(data)

  meal_id category  cuisine
1 1885    Beverages Thai
2 1993    Beverages Thai
3 2539    Beverages Thai
4 1248    Beverages Indian
5 2631    Beverages Indian
6 1311    Extras    Thai

In [12]:
## gives the number of columns in the dataset
cat("Total Columns: ", ncol(data))

Total Columns:  3

In [13]:
## gives the number of rows in the dataset

cat("Total Rows:", nrow(data))

Total Rows: 51

In [14]:
## gives the minimum value  in the given column of the dataset


min_data <- min(data$meal_id)  
print(min_data)

[1] 1062

In [15]:
## gives the maximum value  in the given column of the dataset


max_data <- max(data$meal_id)  
print(max_data)

[1] 2956

In [16]:
# return subset of csv where number of meal id 
# is greater than 1500 


sub_data <- subset(data, meal_id > 1500) 
print(sub_data)

   meal_id     category     cuisine
1     1885    Beverages        Thai
2     1993    Beverages        Thai
3     2539    Beverages        Thai
5     2631    Beverages      Indian
8     1778    Beverages     Italian
9     1803       Extras        Thai
11    2707    Beverages     Italian
12    1847         Soup        Thai
14    2494         Soup        Thai
15    2760 Other Snacks        Thai
16    2490        Salad     Italian
18    2290    Rice Bowl      Indian
19    1525 Other Snacks        Thai
20    2704 Other Snacks        Thai
21    1878     Starters        Thai
22    2640     Starters        Thai
23    2577     Starters        Thai
24    1754     Sandwich     Italian
25    1971     Sandwich     Italian
26    2306        Pasta     Italian
27    2139    Beverages      Indian
28    2826     Sandwich     Italian
29    2664        Salad     Italian
30    2569        Salad     Italian
33    2322    Beverages Continental
34    2492       Desert      Indian
36    1727    Rice Bowl      Indian
37    1902      Biryani      Indian
39    2304       Desert      Indian
40    1543       Desert      Indian
41    1770      Biryani      Indian
42    2126        Pasta     Italian
43    1558        Pizza Continental
44    2581        Pizza Continental
45    1962        Pizza Continental
46    1571         Fish Continental
47    2956         Fish Continental
48    2104         Fish Continental
49    2444      Seafood Continental
50    2867      Seafood Continental

In [17]:
## Creating New Dataframe


dataframe1 <- data.frame (
  Name = c("Juan", "Alcaraz", "Simantha"),
  Age = c(22, 15, 19),
  Vote = c(TRUE, FALSE, TRUE))

In [18]:
## Printing the new dataframe

dataframe1

  Name     Age Vote
1 Juan     22   TRUE
2 Alcaraz  15  FALSE
3 Simantha 19   TRUE

In [19]:
# write dataframe1 into file1 csv file


write.csv(dataframe1, "file1.csv")

In [20]:
## again reading that dataframe into variable

read_data2 <- read.csv("file1.csv")
print(read_data2)

  X     Name Age  Vote
1 1     Juan  22  TRUE
2 2  Alcaraz  15 FALSE
3 3 Simantha  19  TRUE